app/views/public_recipes/index.html.erb

          <div class="right-content">
            <p><strong>Total Food Items:</strong> <%= recipe.foods.count %></p>
---
SELECT COUNT(*) FROM "foods" INNER JOIN "recipe_foods" ON "foods"."id" = "recipe_foods"."food_id" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 4]]