app/controllers/application_controller.rb

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def calculate_total_price_from_recipe_foods(recipe_foods)
      recipe_foods.sum { |recipe_food| recipe_food.food.price * recipe_food.quantity }