app/controllers/recipes_controller.rb

  def create
    @recipe = current_user.recipes.build(recipe_params)

    if @recipe.save
---
INSERT INTO "recipes" ("name", "preparation_time", "cooking_time", "description", "public", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def toggle_public
    if @recipe.user == current_user
      @recipe.update(public: !@recipe.public)
---
UPDATE "recipes" SET "public" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["public", true], ["updated_at", "2023-11-18 11:14:35.815671"], ["id", 4]]

  def generate_shopping_list
    @recipe = Recipe.find(params[:id])

    @shopping_list_items = @recipe.recipe_foods.includes(:food).map do |recipe_food|
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" IN ($1, $2)  [["id", 2], ["id", 3]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 5]]