app/controllers/recipe_foods_controller.rb

SELECT "foods".* FROM "foods"
---
    def new
      @recipe_food = @recipe.recipe_foods.build
      @foods = Food.all

INSERT INTO "recipe_foods" ("quantity", "recipe_id", "food_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 123], ["recipe_id", 5], ["food_id", 2], ["created_at", "2023-11-18 11:15:15.629483"], ["updated_at", "2023-11-18 11:15:15.629483"]]
---
    def create
      @recipe_food = @recipe.recipe_foods.build(recipe_food_params)
      if @recipe_food.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_recipe
      @recipe = Recipe.find(params[:recipe_id])

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def set_recipe_food
      @recipe_food = @recipe.recipe_foods.find(params[:id])